<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"618d52583059601b5ed024bcc405cd3ce3821c945f6c7176d1d1b61a7bd8b6d1","plan_job_ref":"Job plan #3 at https://github.com/GSA/usnotify-ssb/actions/runs/4078559925","plan_hash":"81b5ae9cfb23d4ae6b9516c2afd3374e793bdf3a84be21f1caa0c7d2339b94b9","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = true
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-smtp"
      + path                       = "./app-ssb-smtp.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "aJd/AbBGYTlIZOOZwPEATyFY6ra7e447sZTd5XhOOTg="
      + space                      = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = "4dc86e07-7c24-4acb-b861-7cbd444a7c31"
        }
    }

  # module.broker_smtp.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-smtp-notify-management-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + url                              = (known after apply)
      + username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-sandbox"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-sandbox"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "420bb231-f99f-4dea-8cda-d342981d2718"
      + url                              = (known after apply)
      + username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + url                              = (known after apply)
      + username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #2](https://github.com/GSA/usnotify-ssb/actions/runs/4078593997)